 IDENTIFICATION DIVISION.
 PROGRAM-ID. INPUT-SORT.
 ENVIRONMENT DIVISION.
 INPUT-OUTPUT SECTION.
*
 FILE-CONTROL.
      SELECT INPUT-FILE      ASSIGN TO 'EMPLOYEE.DAT'.
      SELECT SORT-FILE       ASSIGN TO 'SORTFILE.DAT'.
      SELECT OUTPUT-FILE     ASSIGN TO 'INPUTSORT.DAT'.
*
 DATA DIVISION.
 FILE SECTION.
 FD  INPUT-FILE
     RECORD CONTAINS 50 CHARACTERS
     RECORDING MODE IS F.
 01  EMP-RECORD.
     03  EMP-ID           PIC X(05).
     03  EMP-NAME         PIC X(15).
     03  EMP-LOC          PIC X(03).
     03  EMP-DOB          PIC X(08).
     03  EMP-TECH         PIC X(05).
     03  EMP-EARN         PIC 9(05)V99.
     03  EMP-DEDN         PIC 9(05)V99.
*     
 SD  SORT-FILE.
 01  SORT-RECORD.
     03  S-EMP-ID         PIC X(05).
     03  FILLER           PIC X(15).
     03  S-EMP-LOC        PIC X(03).
     03  FILLER           PIC X(08).
     03  S-EMP-TECH       PIC X(05).
     03  FILLER           PIC X(14).
*     
 FD  OUTPUT-FILE
     RECORD CONTAINS 50 CHARACTERS
     RECORDING MODE IS F.
 01  OUT-RECORD           PIC X(50).
*
 WORKING-STORAGE SECTION.
 01  EOF PIC X(01) VALUE 'N'.
*
 PROCEDURE DIVISION.
 MAIN-PARA.
      PERFORM 1111-SORT-PARA
      STOP RUN.     
*      
 1111-SORT-PARA.
     SORT SORT-FILE
         ON ASCENDING KEY S-EMP-LOC
         ON ASCENDING KEY S-EMP-TECH
         ON ASCENDING KEY S-EMP-ID
         USING INPUT-FILE
         GIVING OUTPUT-FILE.
*         
