 IDENTIFICATION DIVISION.
 PROGRAM-ID. PROG11.
 DATA DIVISION.
 WORKING-STORAGE SECTION.
 01  MARKS                  PIC 9(02).
     88 DISTINCTION         VALUE 70 THRU 99.
     88 FIRST-CLASS         VALUE 60 THRU 69.
     88 SECOND-CLASS        VALUE 50 THRU 59.
     88 PASS-CLASS          VALUE 40 THRU 49.
     88 FAIL                VALUE 0 THRU 39.
 01  WS-VARIABLE            PIC X(10).    
*
 PROCEDURE DIVISION.
     ACCEPT MARKS
     EVALUATE TRUE
         WHEN DISTINCTION
              DISPLAY 'PASSED WITH DISTINCTION'
         WHEN FIRST-CLASS
              DISPLAY 'PASSED WITH FIRST-CLASS'
         WHEN SECOND-CLASS
              DISPLAY 'PASSED WITH SECOND-CLASS'
         WHEN PASS-CLASS
              DISPLAY 'PASSED WITH PASS-CLASS'
         WHEN FAIL
              DISPLAY 'FAIL'
         WHEN OTHER
              DISPLAY 'INVALID MARKS!!!'
     END-EVALUATE.
     ACCEPT WS-VARIABLE
     STOP RUN.
* 
