 IDENTIFICATION DIVISION.
 PROGRAM-ID. PROG01.
 DATA DIVISION.
 WORKING-STORAGE SECTION.
 01  WS-VARIABLE PIC X(90). 
 PROCEDURE DIVISION.
     DISPLAY 'HELLO WORLD'
     DISPLAY 'CAPGEMINI'
*    ACCEPT WS-VARIABLE
     STOP RUN.
