 IDENTIFICATION DIVISION.
 PROGRAM-ID. PROG03.
 DATA DIVISION.
 WORKING-STORAGE SECTION.
 01  WS-GROUPA.
     03  WS-GRP1.
         05  WS-I1      PIC X(10).
         05  WS-I2      PIC X(5).
     03  WS-GRP2.
         05  WS-I3      PIC X(10).
         05  WS-I4      PIC X(5).
 PROCEDURE DIVISION.
*    ACCEPT WS-GROUPA
     ACCEPT WS-GRP1
     DISPLAY WS-I1
     DISPLAY WS-I2
     ACCEPT WS-GRP2
     DISPLAY WS-I3
     DISPLAY WS-I4
     STOP RUN.
