 IDENTIFICATION DIVISION.
 PROGRAM-ID. PROG02.
 DATA DIVISION.
 WORKING-STORAGE SECTION.
 01  WS-INPUT1           PIC X(10).
 01  WS-INPUT2           PIC X(5).
 01  WS-VARIABLE         PIC X(10).
 PROCEDURE DIVISION.
     ACCEPT WS-INPUT1
     DISPLAY WS-INPUT1
     ACCEPT WS-INPUT2
     DISPLAY WS-INPUT2
     ACCEPT WS-VARIABLE
     STOP RUN.
