 IDENTIFICATION DIVISION.
 PROGRAM-ID. PROG16.
 ENVIRONMENT DIVISION.
 INPUT-OUTPUT SECTION.
 FILE-CONTROL.
     SELECT EMPMAST-FILE ASSIGN TO 'EMPMAST.DAT'
     ACCESS MODE IS RANDOM
     ORGANIZATION IS INDEXED
     RECORD KEY IS EMP-ID
     FILE STATUS IS WS-EMPMAST-STAT.
     SELECT TRANS-FILE ASSIGN TO 'TRANS.DAT'
     ACCESS MODE IS SEQUENTIAL
     ORGANIZATION IS SEQUENTIAL
     FILE STATUS IS WS-TRANS-STAT.
     SELECT REPORT-FILE ASSIGN TO 'REPORT.REP'
     FILE STATUS IS WS-REPORT-STAT.
 DATA DIVISION.
 FILE SECTION.
 FD EMPMAST-FILE 
     RECORD CONTAINS 50 CHARACTERS
     RECORDING MODE IS F.
 01 EMPMAST-RECORD.
     03 EMP-ID             PIC X(05).
     03 EMP-NAME           PIC X(15). 
     03 EMP-LOC            PIC X(03).
     03 EMP-DOB            PIC X(08).
     03 EMP-TECH           PIC X(05).
     03 EMP-EARN           PIC 9(05)V99.
     03 EMP-DEDN           PIC 9(05)V99. 
 FD TRANS-FILE 
     RECORD CONTAINS 51 CHARACTERS
     RECORDING MODE IS F.
 01 TRANS-RECORD.
     03 T-CODE           PIC X(01).
     03 T-ID             PIC X(05).
     03 T-NAME           PIC X(15). 
     03 T-LOC            PIC X(03).
     03 T-DOB            PIC X(08).
     03 T-TECH           PIC X(05).
     03 T-EARN           PIC 9(05)V99.
     03 T-DEDN           PIC 9(05)V99. 
 FD REPORT-FILE 
     RECORDING MODE IS F
     RECORD CONTAINS 50 CHARACTERS.     
 01 REPORT-RECORD        PIC X(50).
 WORKING-STORAGE SECTION. 
 01 WS-MONTH-TABLE  PIC X(36) VALUE
     'JANFEBMARAPRMAYJUNJULAUGSEPNOVDEC'.
 01 FILLER  REDEFINES WS-MONTH-TABLE .
     03 WS-MONTH PIC X(03) OCCURS 12 TIMES.
 01 EMP-RECORD.
     03 S-ID             PIC X(05).
     03 S-NAME           PIC X(15). 
     03 S-LOC            PIC X(03).
     03 S-DOB            PIC X(08).
     03 S-TECH           PIC X(05).
     03 S-EARN           PIC 9(05)V99.
     03 S-DEDN           PIC 9(05)V99. 
 01 WS-DATE.
     03 DISPLAY-YY       PIC 9(02). 
     03 DISPLAY-MM       PIC 9(02).
     03 DISPLAY-DD       PIC 9(02).
 01 WS-TIME.
     03 DISPLAY-HH   PIC 9(02). 
     03 DISPLAY-MN   PIC 9(02).
     03 DISPLAY-SS   PIC 9(02). 
 01 WS-TOTAL         PIC 9(02) VALUE ZERO.
 01 DETAIL-LINE.
     03 D-ID             PIC X(05).
     03 FILLER           PIC X(01) VALUE SPACES.
     03 D-CODE           PIC X(01).
     03 FILLER           PIC X(04).
     03 MESSAGE2         PIC X(20).  
 01 HEADING-LINE1.
     03 FILLER           PIC X(06) VALUE 'DATE :'.
     03 FILLER           PIC X(01).
     03 DISPLAY-DATE.
         05 DISPLAY-DD   PIC 9(02).
         05 FILLER       PIC X(01) VALUE '-'.
         05 DISPLAY-MMM  PIC X(03).
         05 FILLER       PIC X(01) VALUE '-'.
         05 DISPLAY-YY   PIC 9(02).
     03 FILLER           PIC X(19) VALUE SPACES.
     03 FILLER           PIC X(06) VALUE 'TIME :'.
     03 DISPLAY-TIME.     
         05 DISPLAY-HH   PIC 9(02).
         05 FILLER       PIC X(01) VALUE ':'.
         05 DISPLAY-MN   PIC 9(02).
         05 FILLER       PIC X(01) VALUE ':'.
         05 DISPLAY-SS   PIC 9(02).
 01 HEADING-LINE2.
     03 FILLER           PIC X(41) VALUE 
             'STATUS OF EMPLOYEE MASTER UPDATE'.
     03 FILLER           PIC X(06) VALUE 
             'PAGE :'.
     03 DISPLAY-PAGE     PIC X(02) VALUE ZERO.
     03 FILLER           PIC X(01) VALUE SPACE.
 01 HEADING-LINE3.
     03 FILLER           PIC X(05) VALUE 'ID '.
     03 FILLER           PIC X(03) VALUE ' C '.
     03 FILLER           PIC X(42) VALUE 'STATUS/MESSAGE'.
 01 WS-EMPMAST-STAT      PIC X(02).
     88 OPEN-EMPMAST-SUCESS        VALUE 00.
 01 WS-TRANS-STAT        PIC X(02).
     88 OPEN-TRANS-SUCESS          VALUE 00.
 01 WS-REPORT-STAT       PIC X(02).
     88 OPEN-REPORT-SUCESS         VALUE 00.
 01 WS-EMPMAST-FLAG      PIC X(02) VALUE 'N'. 
     88 END-EMPMAST-FILE           VALUE 'Y'.
 01 WS-TRANS-FLAG        PIC X(02) VALUE 'N'. 
     88 END-TRANS-FILE             VALUE 'Y'.    
 01 WS-REPORT-FLAG       PIC X(02) VALUE 'N'. 
     88 END-REPORT-FILE            VALUE 'Y'.
 PROCEDURE DIVISION.
 MAIN-PARA.
     PERFORM 1000-INIT-PARA 
     PERFORM 2500-HEADING-PARA
     PERFORM 2000-PROCESS-PARA UNTIL END-TRANS-FILE
     PERFORM 9000-END-PARA.
     STOP RUN.
 1000-INIT-PARA.
     OPEN I-O EMPMAST-FILE
     OPEN INPUT TRANS-FILE
     OPEN OUTPUT REPORT-FILE
     DISPLAY WS-EMPMAST-STAT
     DISPLAY WS-TRANS-STAT
     DISPLAY WS-REPORT-STAT
     PERFORM 1500-READ-PARA.
 1500-READ-PARA.
     READ TRANS-FILE
     AT END 
         MOVE 'Y' TO WS-TRANS-FLAG 
     NOT AT END
         ADD 1 TO WS-TOTAL
     END-READ.
 2500-HEADING-PARA.
     ACCEPT WS-DATE FROM DATE
     ACCEPT WS-TIME FROM TIME 
     MOVE CORR WS-DATE TO DISPLAY-DATE 
     MOVE CORR WS-TIME TO DISPLAY-TIME
     MOVE WS-MONTH(DISPLAY-MM) TO DISPLAY-MMM
     WRITE REPORT-RECORD FROM HEADING-LINE1
     WRITE REPORT-RECORD FROM HEADING-LINE2
     WRITE REPORT-RECORD FROM HEADING-LINE3.     
 2000-PROCESS-PARA.
     READ EMPMAST-FILE
     END-READ. 
     PERFORM 8500-CHECK-PARA UNTIL END-EMPMAST-FILE
     MOVE 'N' TO WS-EMPMAST-FLAG.
 8500-CHECK-PARA.
     EVALUATE T-CODE
         WHEN 'A'
             PERFORM 3000-ADD-PARA
         WHEN 'U' 
             PERFORM 3500-UPDATE-PARA
         WHEN 'D'
             PERFORM 4000-DELETE-PARA
     END-EVALUATE.   
     PERFORM 1500-READ-PARA.
 3000-ADD-PARA.
     MOVE T-ID TO EMP-ID
     WRITE EMPMAST-RECORD
         INVALID KEY
             PERFORM 4500-MOVE-PARA
             MOVE 'RECORD ADDED ' TO MESSAGE2
             MOVE 'Y' TO WS-EMPMAST-FLAG
         NOT INVALID KEY
             MOVE 'DUPLICATE KEY ' TO MESSAGE2 
             MOVE 'Y' TO WS-EMPMAST-FLAG
     END-WRITE. 
     WRITE REPORT-RECORD FROM DETAIL-LINE.
 3500-UPDATE-PARA.
     MOVE T-ID TO EMP-ID
     REWRITE EMPMAST-RECORD
         INVALID KEY
             MOVE 'EMP-ID NOT FOUND ' TO MESSAGE2
             MOVE 'Y' TO WS-EMPMAST-FLAG
         NOT INVALID KEY
             PERFORM 4500-MOVE-PARA  
             MOVE ' RECORD UPDATED ' TO MESSAGE2
             MOVE 'Y' TO WS-EMPMAST-FLAG
     END-REWRITE.  
     WRITE REPORT-RECORD FROM DETAIL-LINE.
 4000-DELETE-PARA.
     MOVE T-ID TO EMP-ID
     DELETE EMPMAST-FILE
         INVALID KEY
             MOVE 'EMP-ID NOT FOUND ' TO MESSAGE2
             MOVE 'Y' TO WS-EMPMAST-FLAG
         NOT INVALID KEY
             PERFORM 4500-MOVE-PARA  
             MOVE ' RECORD DELETED ' TO MESSAGE2
             MOVE 'Y' TO WS-EMPMAST-FLAG
     END-DELETE. 
     WRITE REPORT-RECORD FROM DETAIL-LINE.
 4500-MOVE-PARA.
     MOVE T-ID    TO   D-ID
     MOVE T-CODE  TO   D-CODE.
 9000-END-PARA.
     CLOSE EMPMAST-FILE
     CLOSE TRANS-FILE
     CLOSE REPORT-FILE.
     
